results/out/aleph.ring-interceptors.async.java11.G1GC.r20k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 3.860ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.073ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.016ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 4.102ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.206ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.140ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 3.818ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.043ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.162ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.145ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.034ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 3.796ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.039ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.277ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.194ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 3.629ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.02ms    6.00ms 114.43ms   88.99%
    Req/Sec     1.28k   246.13     3.95k    83.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.83ms
 75.000%    3.75ms
 90.000%   10.83ms
 99.000%   30.77ms
 99.900%   48.13ms
 99.990%   65.66ms
 99.999%   90.82ms
100.000%  114.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.078     0.000000            1         1.00
       0.625     0.100000      1180267         1.11
       0.921     0.200000      2362955         1.25
       1.176     0.300000      3540885         1.43
       1.454     0.400000      4721389         1.67
       1.834     0.500000      5899949         2.00
       2.085     0.550000      6492528         2.22
       2.403     0.600000      7081344         2.50
       2.785     0.650000      7668446         2.86
       3.221     0.700000      8259272         3.33
       3.753     0.750000      8848888         4.00
       4.111     0.775000      9145339         4.44
       4.615     0.800000      9439037         5.00
       5.563     0.825000      9733496         5.71
       7.211     0.850000     10028474         6.67
       8.927     0.875000     10323218         8.00
       9.847     0.887500     10470806         8.89
      10.831     0.900000     10618225        10.00
      11.903     0.912500     10765417        11.43
      13.039     0.925000     10913450        13.33
      14.311     0.937500     11060838        16.00
      15.015     0.943750     11134102        17.78
      15.847     0.950000     11207812        20.00
      16.943     0.956250     11281865        22.86
      18.351     0.962500     11355380        26.67
      20.031     0.968750     11428871        32.00
      21.231     0.971875     11466076        35.56
      22.543     0.975000     11502987        40.00
      23.903     0.978125     11539599        45.71
      25.407     0.981250     11576499        53.33
      27.135     0.984375     11613450        64.00
      28.047     0.985938     11631761        71.11
      29.007     0.987500     11650261        80.00
      30.047     0.989062     11668545        91.43
      31.279     0.990625     11687115       106.67
      32.671     0.992188     11705558       128.00
      33.407     0.992969     11714649       142.22
      34.271     0.993750     11724122       160.00
      35.199     0.994531     11733208       182.86
      36.319     0.995313     11742338       213.33
      37.727     0.996094     11751622       256.00
      38.495     0.996484     11756081       284.44
      39.391     0.996875     11760759       320.00
      40.415     0.997266     11765325       365.71
      41.759     0.997656     11769940       426.67
      43.231     0.998047     11774552       512.00
      44.063     0.998242     11776873       568.89
      44.927     0.998437     11779158       640.00
      45.919     0.998633     11781443       731.43
      47.007     0.998828     11783719       853.33
      48.287     0.999023     11786027      1024.00
      49.023     0.999121     11787175      1137.78
      49.855     0.999219     11788355      1280.00
      50.815     0.999316     11789496      1462.86
      51.935     0.999414     11790657      1706.67
      53.023     0.999512     11791790      2048.00
      53.695     0.999561     11792370      2275.56
      54.399     0.999609     11792926      2560.00
      55.263     0.999658     11793517      2925.71
      56.255     0.999707     11794084      3413.33
      57.599     0.999756     11794654      4096.00
      58.431     0.999780     11794943      4551.11
      59.327     0.999805     11795234      5120.00
      60.383     0.999829     11795526      5851.43
      61.887     0.999854     11795806      6826.67
      63.743     0.999878     11796094      8192.00
      64.767     0.999890     11796241      9102.22
      65.919     0.999902     11796388     10240.00
      67.327     0.999915     11796526     11702.86
      68.991     0.999927     11796670     13653.33
      70.655     0.999939     11796814     16384.00
      71.935     0.999945     11796891     18204.44
      73.151     0.999951     11796958     20480.00
      74.303     0.999957     11797031     23405.71
      75.519     0.999963     11797103     27306.67
      77.055     0.999969     11797174     32768.00
      78.399     0.999973     11797212     36408.89
      79.615     0.999976     11797248     40960.00
      81.279     0.999979     11797282     46811.43
      84.543     0.999982     11797318     54613.33
      86.783     0.999985     11797355     65536.00
      87.487     0.999986     11797372     72817.78
      88.511     0.999988     11797390     81920.00
      90.303     0.999989     11797409     93622.86
      91.967     0.999991     11797426    109226.67
      93.567     0.999992     11797445    131072.00
      94.783     0.999993     11797453    145635.56
      95.743     0.999994     11797462    163840.00
      96.447     0.999995     11797471    187245.71
      97.535     0.999995     11797480    218453.33
      99.135     0.999996     11797489    262144.00
     100.671     0.999997     11797495    291271.11
     101.183     0.999997     11797499    327680.00
     101.887     0.999997     11797503    374491.43
     103.039     0.999998     11797508    436906.67
     103.551     0.999998     11797512    524288.00
     103.743     0.999998     11797514    582542.22
     105.407     0.999998     11797516    655360.00
     106.239     0.999999     11797519    748982.86
     106.431     0.999999     11797522    873813.33
     106.687     0.999999     11797523   1048576.00
     106.815     0.999999     11797525   1165084.44
     106.815     0.999999     11797525   1310720.00
     108.159     0.999999     11797527   1497965.71
     108.351     0.999999     11797528   1747626.67
     110.783     1.000000     11797529   2097152.00
     110.783     1.000000     11797529   2330168.89
     111.295     1.000000     11797530   2621440.00
     111.743     1.000000     11797531   2995931.43
     111.743     1.000000     11797531   3495253.33
     111.871     1.000000     11797532   4194304.00
     111.871     1.000000     11797532   4660337.78
     111.871     1.000000     11797532   5242880.00
     112.191     1.000000     11797533   5991862.86
     112.191     1.000000     11797533   6990506.67
     112.191     1.000000     11797533   8388608.00
     112.191     1.000000     11797533   9320675.55
     112.191     1.000000     11797533  10485760.00
     114.495     1.000000     11797534  11983725.71
     114.495     1.000000     11797534          inf
#[Mean    =        4.019, StdDeviation   =        5.997]
#[Max     =      114.432, Total count    =     11797534]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11998784 requests in 10.00m, 2.00GB read
Requests/sec:  19997.94
Transfer/sec:      3.41MB